HttpLoggingMiddlewareSample/artillery.yml
config:
  target: "http://localhost:5092"
  plugins:
    expect: {}
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 120
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Get weather forecast"
    flow:
      - get:
          url: "/weatherforecast"
          expect: 
            statusCode:
            - 200
            - 307